In [4]:
import pandas as pd

In [5]:
data = { "Name": ["Mehmet","Ali","Zeynep","Selin"], "Age": [23,21,43,41], "City": ["İstanbul","Ankara","Çanakkale","Balıkesir"],"Salary": [5000,6000,7000,8000] }
data

{'Name': ['Mehmet', 'Ali', 'Zeynep', 'Selin'],
 'Age': [23, 21, 43, 41],
 'City': ['İstanbul', 'Ankara', 'Çanakkale', 'Balıkesir'],
 'Salary': [5000, 6000, 7000, 8000]}

In [6]:
df1 = pd.DataFrame(data)
df1

     Name  Age       City  Salary
0  Mehmet   23   İstanbul    5000
1     Ali   21     Ankara    6000
2  Zeynep   43  Çanakkale    7000
3   Selin   41  Balıkesir    8000

In [7]:
# 1- DataFrame hakkında bilgi verir
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Salary  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [8]:
# 2- İstatistiksel özet verir
df1.describe()

             Age       Salary
count   4.000000     4.000000
mean   32.000000  6500.000000
std    11.604597  1290.994449
min    21.000000  5000.000000
25%    22.500000  5750.000000
50%    32.000000  6500.000000
75%    41.500000  7250.000000
max    43.000000  8000.000000

In [9]:
# 3- Etikete göre veri seçimi yapar
df1.loc[2, "Name"]

'Zeynep'

In [10]:
# 4- indekse göre veri seçimi yapar
df1.iloc[1, 2]

'Ankara'

In [11]:
# 5- Veriyi gruplar ve işlem yapar
df1.groupby("City")["Age"].mean()

City
Ankara       21.0
Balıkesir    41.0
Çanakkale    43.0
İstanbul     23.0
Name: Age, dtype: float64

In [12]:
# 6- Veriyi sıralar
df1.sort_values(by="Age", ascending=False)

     Name  Age       City  Salary
2  Zeynep   43  Çanakkale    7000
3   Selin   41  Balıkesir    8000
0  Mehmet   23   İstanbul    5000
1     Ali   21     Ankara    6000

In [13]:
# 7- Eksik verileri doldurur
df1.loc["Salary"] = None # Age de eksik bir değer oluştur
df1.fillna(0) # Eksik değerleri 0 ile doldurur.

          Name   Age       City  Salary
0       Mehmet  23.0   İstanbul  5000.0
1          Ali  21.0     Ankara  6000.0
2       Zeynep  43.0  Çanakkale  7000.0
3        Selin  41.0  Balıkesir  8000.0
Salary       0   0.0          0     0.0

In [14]:
# 8- Satır ve ya sütunlarda özel bir işlem yapar
df1["Salary"] = df1["Salary"].apply(lambda x: x * 1.10 if x is not None else x) # Salary sütunundaki değerleri %10 arttırır.
df1

          Name   Age       City  Salary
0       Mehmet  23.0   İstanbul  5500.0
1          Ali  21.0     Ankara  6600.0
2       Zeynep  43.0  Çanakkale  7700.0
3        Selin  41.0  Balıkesir  8800.0
Salary     NaN   NaN        NaN     NaN

In [15]:
# 9- Belirli bir satır ve ya sütunu kaldırmak için kullanılır
df = df1.drop(2)
df1

          Name   Age       City  Salary
0       Mehmet  23.0   İstanbul  5500.0
1          Ali  21.0     Ankara  6600.0
2       Zeynep  43.0  Çanakkale  7700.0
3        Selin  41.0  Balıkesir  8800.0
Salary     NaN   NaN        NaN     NaN

In [16]:
# 10- Sütun isimlerini değiştirmek için kullanılır
df1 = df1.rename(columns={"Name": "Employee Name", "Salary": "Income"})
df1

       Employee Name   Age       City  Income
0             Mehmet  23.0   İstanbul  5500.0
1                Ali  21.0     Ankara  6600.0
2             Zeynep  43.0  Çanakkale  7700.0
3              Selin  41.0  Balıkesir  8800.0
Salary           NaN   NaN        NaN     NaN